<a href="https://colab.research.google.com/github/manjeetsrivastava/data-analysis-of-sanfrancisco-employee-salaries/blob/main/data_analysis_on_sanfrancisco_employee_salary_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [27]:
import pandas as pd
import numpy as np

In [ ]:
df = pd.read_csv('/content/Salaries.csv')

In [ ]:
df.T

# 1. DISPLAY TOP 10 ROWS OF DATAFRAME

In [15]:
df.head(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011.0,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011.0,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011.0,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011.0,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011.0,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.00,8601.00,189082.74,NaN,316285.74,316285.74,2011.0,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.90,134426.14,NaN,315981.05,315981.05,2011.0,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.00,51322.50,NaN,307899.46,307899.46,2011.0,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011.0,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.00,0.00,17115.73,NaN,302377.73,302377.73,2011.0,NaN,San Francisco,NaN

# 2. CHECK THE LAST 10 ROWS OF THE DATABASE

In [ ]:
df.tail(10)

# 3. FIND SHAPE OF OUR DATASET

In [17]:
df.shape
# here in output the first represents the number of rows and second repsresent the number of columns

(97380, 13)

# 4. GETTING INFORMATION ABOUT OUR DATASETS LIKE TOTAL NUMBER OF ROWS,TOTAL NUMBER OF COLUMNS,DATATYPE OF EACH COLUMN AND MEMEORY REQUIREMENT

In [ ]:
df.info()

# 5.CHECK NULL VALUES IN THE DATASET

In [20]:
df.isnull().sum()
# isnull() returns boolean value(true/false) whereas isnull.sum() returns the total no of nulll values in each column

Id                      0
EmployeeName            0
JobTitle                1
BasePay                 9
OvertimePay             1
OtherPay                1
Benefits            36160
TotalPay                1
TotalPayBenefits        1
Year                    1
Notes               97380
Agency                  1
Status              97380
dtype: int64

# 6. DROP ID,NOTES,AGENCY AND STATUS COLUMNS

In [30]:
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [31]:
len(df.columns)

13

In [32]:
df.drop(['Id','Notes','Agency','Status'],axis =1 , inplace = True)

In [33]:
df.columns

Index(['EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year'],
      dtype='object')

In [34]:
len(df.columns)

9

# 7. Get overall statistics about the dataframe

In [35]:
df.describe(include = "all")
# df.describe() bydefault returns the statistics about the numerical data present in the dataset

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148654,148654,148049.0,148654.0,148654.0,112495.0,148654.000000,148654.000000,148654.000000
unique,110811,2159,109900.0,66555.0,84968.0,99635.0,NaN,NaN,NaN
top,Kevin Lee,Transit Operator,0.0,0.0,0.0,0.0,NaN,NaN,NaN
freq,13,7036,875.0,66103.0,35218.0,1053.0,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,74768.321972,93692.554811,2012.522643
std,NaN,NaN,NaN,NaN,NaN,NaN,50517.005274,62793.533483,1.117538
min,NaN,NaN,NaN,NaN,NaN,NaN,-618.130000,-618.130000,2011.000000
25%,NaN,NaN,NaN,NaN,NaN,NaN,36168.995000,44065.650000,2012.000000
50%,NaN,NaN,NaN,NaN,NaN,NaN,71426.610000,92404.090000,2013.000000
75%,NaN,NaN,NaN,NaN,NaN,NaN,105839.135000,132876.450000,2014.000000
max,NaN,NaN,NaN,NaN,NaN,NaN,567595.430000,567595.430000,2014.000000

# 8. FIND OCCURENCES OF EMPLOYEE NAME(TOP 5)

In [36]:
df['EmployeeName'].value_counts().head(5)

Kevin Lee       13
Richard Lee     11
Steven Lee      11
William Wong    11
Stanley Lee      9
Name: EmployeeName, dtype: int64

# 9. FIND THE NUMBER OF UNIQUE JOB TITLES

In [37]:
df['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [38]:
df['JobTitle'].nunique( )

2159

# 10. TOTAL NUMBER OF JOB TITLES CONTAINS CAPTAIN

In [40]:
df[df['JobTitle'].str.contains('CAPTAIN',case = False )]['JobTitle'].count()

552

# 11. DISPLAY ALL EMPLOYEES NAMES FROM THE FIRE DEPARTMENT

In [18]:
empl =[]
empl = df[df['JobTitle'].str.contains('Fire DEpartment' , case = False)]['EmployeeName']
print(*empl ,sep = ",")
# here '*empl ' is used to print all the values of list .

PATRICK GARDNER,ALSON LEE,MICHAEL MORRIS,JOANNE HAYES-WHITE,ARTHUR KENNEY,DAVID FRANKLIN,MARTY ROSS,VICTOR WYRSCH,RAYMOND GUZMAN,MONICA FIELDS,JOSE VELO,BRENDAN WARD,MICHAEL THOMPSON,THOMAS ABBOTT,THOMAS SIRAGUSA,BRYAN RUBENSTEIN,KEN YEE,KIRK RICHARDSON,KENNETH SMITH,CHARLES CRANE,ROBERT POSTEL,RICHARD BUSALACCHI,KEVIN BURKE,EDUARDO GONZALEZ,ROBERT WINSLOW,LORRIE KALOS,MICHAEL BRYANT,MARK GONZALES,REX HALE,KEVIN SMITH,KEVIN TAYLOR,ERIKA HOO,SAMSON LAI,KHAIRUL ALI,JOHN HICKEY,EDWARD CHU,ZACHARY PUMPHREY,MARK CASTAGNOLA,LUIS IBARRA-RIVERA,MICHAEL KEARNEY,MATTHEW MCNAUGHTON,GEORGE LYSENKO,ALBERTO PEDRUCO,DWAYNE CURRY,DENNIS SUTTER,ROBERT SERRANO,JAMES VANNUCCHI,CANTREZ TRIPLETT,RYAN KENNEDY,JOHN ROCCO,EDMUND VAIL,ANDREW SAITZ,BERGLIOTH MATHEWS,PABLO SIGUENZA,DANIEL YONTS,DAVID THOMPSON,JAMES BLAKE,RYAN CREAN,RUDY CASTELLANOS,MICHAEL GONZALES,ROBERT LOPEZ,JOHN MURPHY,KENNETH CORDERO,JIM HALL III,MARK JOHNSON,BRENDAN MCGORRIN,WILLIAM MCFARLAND,RAEMONA WILLIAMS,JEFFREY BARDEN,MATTHEW CANNON,RICHARD UNTALAN,DENNIS O'NEILL,FLOYD ROLLINS,THOMAS KOHMANN,RAUL FRANCISCO,ALAN REYNAUD,DENISE NEWMAN,JOHN CREMEN,FRANK KOSTA,FRANK HSIEH,MATTHEW HUTCHINSON,DAVID BROWN,VINCENT NOLAN,CHERISH MURDOCK,LARS ASPELIN,JORGE PLATA,ANESTO ESTRELLA,KENNETH HUPKE,RONALD LEWIN,JOSEPH SCHIEBOLD,CHRISTINE EMMONS,DONALD GOGGIN,ANTHONY BENDIK,NORMAN CABA,SEAN MCKINNEY,ERNEST CARRILLO,MATTHEW SCHWARTZ,ALEXANDER DOUGLAS JR,DUSTIN WINN,ERIC LEAL,DENNIS SULLIVAN,PATRICK RABBITT,JOSEPH BARBERO,ANNE TAM,CHRISTOPHER MADSEN,JEANINE NICHOLSON,JAMES DRAPER,TERRY SMERDEL,CHARLES MC COY,RANDALL HIRO,LLOYD GOLDBERG,AISHA KRIEGER,CHASE WILSON,TYSON YEE,ALLEN WONG,BRIAN WALSH,PAUL O'KANE,PAUL MCDONAGH,JANEEN PIROSKO,ROBERT ARZAVE,RUBEN MONTERO,DAVID MURRAY,KAREN HEALD,GERALD SCULLION,JENNIFER MATHEWS,DARIUS LUTTROPP,NEAL CAVELLINI,JIRO YAMAMOTO,JOEL SATO,KYLE MERKINS,JEFFREY WONG,DOMINIC OTTOBONI,ANGELA ROMERO,JOHN GRANT,DAVID RITTER,WALTER VILLAVICENCIO,KEVIN PARDINI,MARC KASPER,JOE CHAN,CRISTEO REYES,MICHAEL MALONEY,DAVID SMILEY,ETHAN JACKSON,MICHAEL CHARLTON,PATRICK D'ARCY,LAWRENCE CONRAD,MICHAEL BARRY,STEPHEN CASSIDY,ROBERT KISHI,TIMOTHY FARMER,BRICE PEOPLES,DAWN DEWITT,HEATHER PIPER,MARC EVANS,AARON STEVENSON,EUGENE ADAMS,CATHERINE EMMONS-SAMSON,BRENT STUCKERT,KENNETH JONES,MICHAEL DUNCAN,MATTHEW LEE,ANTHONY RIVERA,ANSON WU,HERMAN WOO,THERESA WOLOWIC,PETER GROSS,JAMES REIDY,THERESA KWAN,ANTHONY SMERDEL,RICKY YEE,ERICA ARTESEROS,ROBERT TURNQUIST,SEAN MULLANE,WAYNE WONG,MICHAEL FUCCIOLO,KATHY AUSTIN,BROCK WELLS,KIMBERLY MC KEON,RAMON SERRANO,GREGORY BLATMAN,PATRICK SULLIVAN,SEAN JOHNSTON,KEVIN MC KEON,THOMAS OERTLI,CHRISTOPHER BENZ,JUSTIN BROWN,CYNTHIA RICKERT,CHADWICK ERTOLA,CECILIA JIANG,JOHN CHUNG,JOHN LOPES,ROBERT NEUNEKER,DANIEL GRIFFIN,SHIRLEY SZELA,KAREN KERR,STEPHEN MC PARTLAN,ROBERT MCDONALD,JAMES APP,ROBERT ZLATUNICH,FREDERICK PUTT,SHANE FRANCISCO,ALAN WONG,CLIFTON MERRILL,KENNETH LINNEY,ANTHONY GARIBALDI,MARK HARDEMAN,DAT TRUONG,DWAYNE NEWTON,ALISON YEE,LEONEL TINGIN,RONALD VANPOOL,LESLIE WONG,HELEN KIEFFER,ROBERT CAPPA,SETH RUBENSTEIN,PATRICIA LUI,PATRICK MARTINEZ,AUDRY LEE,VINCENT PEREZ,JENSEN RHODES,AARON STEVENSON,JAMES BARDEN,Joanne Hayes-White,Joanne M Hayes-White,Robert E Evans,Joanne M Hayes-White

#12. FIND MAXIMUM,MINIMUM AND AVERAGE OF BASEPAY

In [21]:
df.dtypes

EmployeeName         object
JobTitle             object
BasePay              object
OvertimePay          object
OtherPay             object
Benefits             object
TotalPay            float64
TotalPayBenefits    float64
Year                  int64
dtype: object

In [42]:
df.describe()

            TotalPay  TotalPayBenefits           Year
count  148654.000000     148654.000000  148654.000000
mean    74768.321972      93692.554811    2012.522643
std     50517.005274      62793.533483       1.117538
min      -618.130000       -618.130000    2011.000000
25%     36168.995000      44065.650000    2012.000000
50%     71426.610000      92404.090000    2013.000000
75%    105839.135000     132876.450000    2014.000000
max    567595.430000     567595.430000    2014.000000

# 13. REPLACE 'NOT PROVIDED' IN EMPLOYEE NAME WITH NAN

In [44]:
df['EmployeeName']

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650         Not provided
148651         Not provided
148652         Not provided
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

In [48]:
df['EmployeeName']=df['EmployeeName'].replace("Not provided",np.nan)

In [49]:
df["EmployeeName"]

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650                  NaN
148651                  NaN
148652                  NaN
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

# 14. DROP THE ROWS HAVING MORE THAN 5 MISSING VALUES

In [51]:
# MORE THAN 5 MISSING VALUES
df.isnull().sum()
# here df.isna().sum() returns the total null value column  wise but we want null values rowwise so we put(axis =1)

EmployeeName            4
JobTitle                0
BasePay               605
OvertimePay             0
OtherPay                0
Benefits            36159
TotalPay                0
TotalPayBenefits        0
Year                    0
dtype: int64

In [55]:
df.drop(df[df.isnull().sum(axis = 1)==5].index,axis =0,inplace = True)

In [56]:
df.isnull().sum(axis =1)

0         1
1         1
2         1
3         1
4         1
         ..
148649    0
148650    1
148651    1
148652    1
148653    0
Length: 148654, dtype: int64

# 15. FIND THE JOBTITLE OF 'ALBERT PARDINI'

In [ ]:
df[df['EmployeeName'] == 'ALBERT PARDINI']['JobTitle']

2    CAPTAIN III (POLICE DEPARTMENT)
Name: JobTitle, dtype: object

#16.HOW MUCH ALBERT PARDINI MAKE INCLUDES BENEFITS

In [ ]:
df.sample(5)

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
122208,Wilfredo G Padaoan,Transit Operator,67265.16,25023.01,3103.93,35717.27,95392.10,131109.37,2014
148227,Cheryl D Kendrick,Morgue Attendant,514.50,0.00,0.00,0.00,514.50,514.50,2014
56248,Helene Campagnet,Registered Nurse,69199.51,0.0,2317.34,23334.7,71516.85,94851.55,2012
142460,Rico D Tiger,Public Service Trainee,13017.71,0.00,0.00,3423.00,13017.71,16440.71,2014
89395,Selvin Cabrera,Roofer,79136.0,218.85,750.0,29538.34,80104.85,109643.19,2013

In [ ]:
df[df['EmployeeName']=='ALBERT PARDINI']['TotalPayBenefits']

2    335279.91
Name: TotalPayBenefits, dtype: float64

#17. DISPLAY THE NAME OF PERSON HAVING THE HIGHEST BASE PAY

In [59]:
#df[df['BasePay'].max()==data['BasePay']]['EmployeeName']
# this will give the output as employee name which is having highest base pay

# 18. FIND THE AVERAGE TOTAL PAY INCLUDING BENEFITS OF ALL EMPLOYEE PER YEAR

In [63]:
df.groupby('Year').mean()['TotalPayBenefits']
#  HERE GROUPBY METHOD IS USED TO GROUPBY YEAR  AND TEHN FIND THE MEAN OF IT BY.MEAN()

Year
2011     71744.103871
2012    100553.229232
2013    101440.519714
2014    100250.918884
Name: TotalPayBenefits, dtype: float64

#19. FIND THE AVERAGE TOTAL PAY INCLUDING BENEFITS  OF ALL EMPLOYEE PER JOB TITLE

In [64]:
df.groupby('JobTitle').mean()['TotalPayBenefits']

JobTitle
ACCOUNT CLERK                                     44035.664337
ACCOUNTANT                                        47429.268000
ACCOUNTANT INTERN                                 29031.742917
ACPO,JuvP, Juv Prob (SFERS)                       80266.370000
ACUPUNCTURIST                                     67594.400000
                                                      ...
X-RAY LABORATORY AIDE                             52705.880385
X-Ray Laboratory Aide                             69521.123200
YOUTH COMMISSION ADVISOR, BOARD OF SUPERVISORS    53632.870000
Youth Comm Advisor                                60118.550000
ZOO CURATOR                                       66686.560000
Name: TotalPayBenefits, Length: 2159, dtype: float64

# 20.FIND THE AVERAGE OF TOTAL PAY INCLUDING BENEFITS OF EMPLOYEE HAVING JOBTITLE AS ACCOUNTANT

In [69]:
df[df['JobTitle']=='ACCOUNTANT']['TotalPayBenefits'].mean()

47429.268

# 21. FIND TOP 5 MOST COMMON JOBS

In [60]:
df["JobTitle"].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64